# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!
  
#### Import all the necessary libraries here:

In [1]:
import numpy as np
import pandas as pd
import os

# Challenge 1

#### Read the `employees` dataset from Ironhack's database:
* db: `employees`
* table: `employees`

Save your data in a variable called `employees`.

In [5]:
df=pd.read_csv('.\employees.csv')

#### What's the mean `Salary` by `Department`?
**Tip**: There are 2 ways to do it: with or without pivot tables. Do it both ways.

In [6]:
df.head()

  Department Education      Title      Name  Years  Salary
0      Admin    Master  associate     David      4      58
1         IT    Master  associate    Thomas      7      45
2      Admin    Master  associate     Diana     10      52
3      Admin    Master         VP  Manuella     15      33
4      Sales    Master    Analyst     Carla      6      38

In [7]:
# Method 1
df.groupby('Department').Salary.mean()

Department
Admin    76.325203
HR       74.237705
IT       70.671642
Sales    73.132231
Name: Salary, dtype: float64

In [8]:
# Method 2
df.pivot_table(index = 'Department', values ='Salary', aggfunc='mean')

               Salary
Department
Admin       76.325203
HR          74.237705
IT          70.671642
Sales       73.132231

#### Now, group the data by more than one column. Use Pandas pivot table function to select the mean `Salary` by `Department` and `Title`.

In [10]:
df.pivot_table(index=['Department', 'Title'], values ='Salary', aggfunc='mean' )

                         Salary
Department Title
Admin      Analyst    77.736842
           VP         75.571429
           associate  75.813953
HR         Analyst    71.404762
           VP         75.441176
           associate  75.934783
IT         Analyst    69.600000
           VP         74.000000
           associate  68.095238
Sales      Analyst    76.074074
           VP         66.675000
           associate  76.814815

#### Display the number of `Years` of work experience and the `Salary` for each `Title`. Add `Years` as a column in your pivot table.
**Hint**: Use Pandas documentation to explore the [pivot table](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.pivot_table.html) function.

In [21]:
df.pivot_table(index='Title', values='Salary', columns = 'Years')

Years,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
Title,,,,,,,,,,,,,,,
Analyst,75.000000,63.384615,73.388889,77.600000,77.615385,87.444444,67.000000,78.000000,86.454545,73.666667,71.181818,68.642857,69.571429,70.000000,71.200000
VP,74.714286,83.200000,69.000000,82.333333,80.000000,61.071429,78.692308,54.181818,65.666667,70.400000,79.363636,76.222222,87.000000,74.785714,72.272727
associate,77.333333,83.250000,83.562500,73.300000,64.333333,74.454545,70.166667,69.500000,76.090909,73.941176,73.750000,77.700000,62.222222,62.800000,64.500000

#### Find the mean `Salary` and number of employees in each `Department` and for each job `Title`.

In [24]:
df

    Department Education      Title      Name  Years  Salary
0        Admin    Master  associate     David      4      58
1           IT    Master  associate    Thomas      7      45
2        Admin    Master  associate     Diana     10      52
3        Admin    Master         VP  Manuella     15      33
4        Sales    Master    Analyst     Carla      6      38
..         ...       ...        ...       ...    ...     ...
495      Sales       PhD         VP    Calvin      2     119
496         HR    Master    Analyst    Dustin      6      67
497      Sales       PhD         VP   Winston     13      93
498         IT       PhD    Analyst      Earl     12     108
499      Sales    Master    Analyst     Alvin     13      48

[500 rows x 6 columns]

In [26]:
df.pivot_table(index=['Department','Title'], values='Salary', aggfunc='mean')

                         Salary
Department Title
Admin      Analyst    77.736842
           VP         75.571429
           associate  75.813953
HR         Analyst    71.404762
           VP         75.441176
           associate  75.934783
IT         Analyst    69.600000
           VP         74.000000
           associate  68.095238
Sales      Analyst    76.074074
           VP         66.675000
           associate  76.814815

#### For each `Department` and each job `Title`, find the `Salary` median, minimum, maximum and standard deviation. Comment your results.

In [36]:
df.pivot_table(index=['Department','Title'], values='Salary', aggfunc=['mean', 'median', 'max', 'std'])

                           mean median    max        std
                         Salary Salary Salary     Salary
Department Title
Admin      Analyst    77.736842   80.5    120  26.335347
           VP         75.571429   75.5    120  24.927351
           associate  75.813953   79.0    119  26.524253
HR         Analyst    71.404762   72.5    119  25.093056
           VP         75.441176   76.5    119  26.594817
           associate  75.934783   76.0    119  28.063739
IT         Analyst    69.600000   69.0    119  28.418464
           VP         74.000000   71.0    120  25.568323
           associate  68.095238   59.5    117  28.557866
Sales      Analyst    76.074074   72.0    120  27.855999
           VP         66.675000   60.0    119  27.017931
           associate  76.814815   79.0    120  28.266638

In [ ]:
"""
We are able to see by Dep each titles mean/med/max/std salaries.
"""

#### Based on your comments, fill the missing values with an appropriate value.

In [ ]:
# your code here
"""
Based on this question I am not sure I answered correctly above.   
"""

#### The stake holders want to know, for each `Department`, the number of employees and how much money is spent on salaries. Could you provide that information?

In [30]:
df.pivot_table(index='Department', values='Salary', aggfunc=sum)

            Salary
Department
Admin         9388
HR            9057
IT            9470
Sales         8849

#### For each `Department` and `Title`, find the the total years of work experience and the mean `Salary`.

In [32]:
df.pivot_table(index=['Department', 'Title'], values=['Years','Salary'], aggfunc=['sum','mean'])

                        sum             mean
                     Salary Years     Salary     Years
Department Title
Admin      Analyst     2954   292  77.736842  7.684211
           VP          3174   342  75.571429  8.142857
           associate   3260   306  75.813953  7.116279
HR         Analyst     2999   326  71.404762  7.761905
           VP          2565   198  75.441176  5.823529
           associate   3493   351  75.934783  7.630435
IT         Analyst     3132   346  69.600000  7.688889
           VP          3478   409  74.000000  8.702128
           associate   2860   336  68.095238  8.000000
Sales      Analyst     4108   441  76.074074  8.166667
           VP          2667   293  66.675000  7.325000
           associate   2074   138  76.814815  5.111111

## Bonus Challenge 1

#### Compute the mean `Salary` after removing the maximum `Salary` for each `Department`. Create the appropriate pivot table.
**Hint**: Write a custom function.

In [ ]:
# your code here

# Challenge 2

#### Read the `fitbit` dataset from Ironhack's database:
* db: `fitbit`
* table: `fitbit`

Save your data in a variable called `fitbit`.

In [ ]:
# your code here

#### Explore you dataset in terms of data types and descriptive statistics.
**Hint**: Use Pandas functions from previous lectures.

In [ ]:
# your code here

#### You suspect that there must be a linear relationship between the `Minutes Very Active` and the `Steps`. Compute the correlation between these variables.

In [ ]:
# your code here

#### Use matplotlib to visually plot `Minutes Very active` vs `Steps`. We'll work with matplotlib next week. As a first introduction, uncomment and complete the following code. You need to replace the # symbol for the correct function arguments.

In [ ]:
import matplotlib.pyplot as plt;

In [ ]:
"""
plt.scatter(#, #)
plt.title(#)
plt.xlabel(#)
plt.ylabel(#)
plt.show()
"""

#### What can you say about `Minutes Very Active` and `Steps`? Write a comment below.

In [ ]:
"""
your commments here
"""

#### We also suspect that there must be a linear relationship between the `Minutes Sedentary` and the `Steps`. Compute the correlation between these variables.

In [ ]:
# your code here

#### Use matplotlib to visually plot `Minutes Sedentary` vs `Steps`. Based on the results of the computed correlation and the plot, what can you say about these 2 variables?

In [ ]:
# your code here

In [ ]:
"""
your commments here
"""

#### We also suspect that there must be a linear relationship between the `MinutesOfSleep` and the `Steps`. Compute the correlation between these variables.

In [ ]:
# your code here

#### Use matplotlib to visually plot `MinutesOfSleep` vs `Steps`. Based on the results of the computed correlation and the plot, what can you say about these 2 variables?

In [ ]:
# your code here

In [ ]:
"""
your commments here
"""

#### Select a subset of your dataset with the columns below and compute the correlation matrix. Save the results in the variable `cor_fit`.

In [ ]:
columns = ['Calorie burned', 'Steps', 'Floors', 'Minutes Sedentary', 'Minutes Very Active', 'MinutesOfSleep']

In [ ]:
# your code here

#### Based on the result of the correlation matrix, which of the features are highly correlated with variable `Steps`?
**Hint**: sort the correlations of `Steps` vs the rest of the features in descending order. You can use Pandas `sort_values`.

In [ ]:
# your code here

# Challenge 3

#### Read the `time_grades` dataset from Ironhack's database:
* db: `time_grades`
* table: `time_grades`

Save your data in a variable called `time_grades`.

In [ ]:
# your code here

#### Show visually the frequency distribution of the `time_grades` dataset.

In [ ]:
# your code here

#### Is there a correlation between `Study time` and `Grade`? Use both Pearson and Spearman correlations and comment your results.

In [ ]:
# your code here

In [ ]:
"""
your commments here
"""

#### Use matplotlib to visually plot `Study time` vs `Grade`. Based on the results of the computed correlation and the plot, what can you say about these 2 variables?

In [ ]:
# your code here

In [ ]:
"""
your commments here
"""

#### Could you explain the difference between Pearson and Spearman correlations?

In [ ]:
"""
your commments here
"""